{"library": [
  {
    "Runtime": "164 min",
    "Released": "20 Jul 2012",
    "Year": 2012,
    "Rated": "PG-13",
    "Plot": "Eight years after the Joker's reign of anarchy, the Dark Knight, with the help of the enigmatic Selia, is forced from his imposed exile to save Gotham City, now on the edge of total annihilation, from the brutal guerrilla terrorist Bane.",
    "Title": "The Dark Knight Rises",
    "Actors": "Christian Bale, Gary Oldman, Tom Hardy, Joseph Gordon-Levitt",
    "Genre": "Action"
  },
  {
    "Runtime": "155 min",
    "Released": "05 May 2000",
    "Year": 2000,
    "Rated": "R",
    "Plot": "When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge.",
    "Title": "Gladiator",
    "Actors": "Russell Crowe, Joaquin Phoenix, Connie Nielsen, Oliver Reed",
    "Genre": "Action"
  },
  {
    "Runtime": "92 min",
    "Released": "25 Jan 2008",
    "Year": 2008,
    "Rated": "R",
    "Plot": "In Thailand, John Rambo joins a group of mercenaries to venture into war-torn Burma, and rescue a group of Christian aid workers who were kidnapped by the ruthless local infantry unit.",
    "Title": "Rambo",
    "Actors": "Sylvester Stallone, Julie Benz, Matthew Marsden, Graham McTavish",
    "Genre": "War"
  },
  {
    "Runtime": "143 min",
    "Released": "04 May 2012",
    "Year": 2012,
    "Rated": "PG-13",
    "Plot": "Earth's mightiest heroes must come together and learn to fight as a team if they are to stop the mischievous Loki and his alien army from enslaving humanity.",
    "Title": "The Avengers",
    "Actors": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth",
    "Genre": "Science Fiction"
  },
  {
    "Runtime": "102 min",
    "Released": "27 Nov 2013",
    "Year": 2013,
    "Rated": "PG",
    "Plot": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice to curse her home in infinite winter, her sister, Anna, teams up with a mountain man, his playful reindeer, and a snowman to change the weather condition.",
    "Title": "Frozen",
    "Actors": "Kristen Bell, Idina Menzel, Jonathan Groff, Josh Gad",
    "Genre": "Comedy"
  },
  {
    "Runtime": "126 min",
    "Released": "02 May 2008",
    "Year": 2008,
    "Rated": "PG-13",
    "Plot": "After being held captive in an Afghan cave, an industrialist creates a unique weaponized suit of armor to fight evil.",
    "Title": "Iron Man",
    "Actors": "Robert Downey Jr., Terrence Howard, Jeff Bridges, Gwyneth Paltrow",
    "Genre": "Action"
  },
  {
    "Runtime": "",
    "Released": "",
    "Year": -1,
    "Rated": "",
    "Plot": "",
    "Title": "The Dark Knight",
    "Actors": "",
    "Genre": ""
  }
]}
